[ 
    {
"date": "2025-11-01",
    "displayDate": "November 1st, 2025 — 9:18 pm",
    "content": "#Haul from earlier today. ^.^ I love the matching colors... After trying on the dress, I'm even more surprised that it was only $20 because the quality is really decent. I wonder if it's because it's technically not a lolita piece, but still. Yay me.",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/haul.jpg"
},
{
"date": "2025-10-31",
    "displayDate": "October 31st, 2025 — 8:04 am",
    "content": "I found this book buried in all of the fabrics that I got last night. I want to start reading through it now but I have to go to work arrgghhh.",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/20251031_080009.jpg"
},
        {
"date": "2025-10-30",
    "displayDate": "October 30th, 2025 — 9:18 pm",
    "content": "I asked my mom if she had a scrap piece of fabric anywhere so that I could practice more stitches, and she ended up giving me a whole box of sewing supplies that I didn't know she still had. I can't Not take this as an opportunity to commit to the craft and learn more... ",
    "image": ""
},
       {
"date": "2025-10-28",
    "displayDate": "October 28th, 2025 — 5:10 pm",
    "content": "Update: I cleaned up all of my code and even started a new page for a future site update, all during my shift. Maybe I should keep bringing my laptop into work...",
    "image": ""
},
      {
"date": "2025-10-28",
    "displayDate": "October 28th, 2025 — 12:48 pm",
    "content": "I took my laptop to work because I hate feeling bored and unproductive during my free time. I'm not sure how often I'll do this because I'm oh-so scared. Or maybe everyone would think “wow she's such a hardworker” since using a laptop probably looks more appealing(?) than scrolling on a phone(?) does this make sense. I guess I can do whatever on my breaks but Agh.",
    "image": ""
},
     {
"date": "2025-10-27",
    "displayDate": "October 27th, 2025 — 10:20 pm",
    "content": "My package came earlier than expected, so now I have cute stationary that I probably won't use any time soon + other things. I also just unintentionally learned how to do an invisible stitch. A very eventful night...",
    "image": ""
},
    {
"date": "2025-10-25",
    "displayDate": "October 25th, 2025 — 12:15 pm",
    "content": "I somehow went from purchasing a $20, secondhand, barely-lolita dress from WunderWelt to ordering 140 dollars' worth of pieces from 42Lolita to create a coord. Don't even ask how much the shipping prices are... I think there's something wrong with me.",
    "image": ""
},
    {
"date": "2025-10-24",
    "displayDate": "October 24th, 2025 — 6:30 am",
    "content": "I'm trying to teach myself how to sew, but I can't even tie a knot for my thread. Let alone make one (1) stitch without messing up. Argh.",
    "image": ""
},
    {
    "date": "2025-10-22",
    "displayDate": "October 22nd, 2025 — 7:50 pm",
    "content": "Update: I bought my first lolita piece! I went with this dress because it's more casual (compared to other lolita pieces) + it was inexpensive, so I thought that this might be a decent starting point. I considered putting a whole coord together, but I also want to make sure that I'll wear the dress often before accesorizing.",
    "image": "https://www.wunderwelt.jp/cdn/shop/files/u-20361-00_1080x.jpg?v=1757406387"
  },
{
    "date": "2025-10-21",
    "displayDate": "October 21st, 2025 — 9:10 am",
    "content": "I somehow forgot to bring my earbuds to work. Fuck my Stupid Baka Life.",
    "image": ""
  },
       {
    "date": "2025-10-19",
    "displayDate": "October 19th, 2025 — 3:00 pm",
    "content": "I spent almost the entirety of my weekend creating my new tips & tricks section, but I'm really happy with how it turned out! I can't wait to add more to it. ^.^",
    "image": ""
  },
      {
    "date": "2025-10-18",
    "displayDate": "October 18th, 2025 — 3:55 pm",
    "content": "It took me forever to finish this cross-stitch that I'm not even super in love with, mostly because there's too much contrast between the pinks that I used. Maybe I could try making more in the future with different colors.",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/lotus.jpg"
  },
    {
    "date": "2025-10-18",
    "displayDate": "October 18th, 2025 — 11:38 am",
    "content": "Barnes & Noble is having a Buy 1 Get 1 50% Off sale for their manga/light novel selection until the 19th! I also got my first paycheck last night, so this was the perfect time for me to finally order vol. 7 & 8 of TGCF!",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/b&n.jpg"
  },
{
    "date": "2025-10-16",
    "displayDate": "October 16th, 2025 — 10:00 pm",
    "content": "I've been going through WunderWelt and found a lot of secondhand dresses that I really like. Maybe I could Finally try getting into this lifestyle now that I have a full-time job... But aaagh. Aaaggghh. I don't want to accidentally be an ita... I guess everyone starts somewhere, I'm just worried about spending too much time/money on something that ends up not suiting me. T.T",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/lolita.jpg"
  },
{
    "date": "2025-10-14",
    "displayDate": "October 14th, 2025 — 9:30 pm",
    "content": "I saved $5 on a purchase today because the lady at the register had a few coupons that she wanted to give out. ^.^ Definitely made up for the incredibly boring shift that I had earlier.",
    "image": ""
  },

  {
    "date": "2025-10-14",
    "displayDate": "October 14th, 2025 — 7:36 am",
    "content": "I still haven't recieved my first paycheck because of an error on HR's end...... My payment rolled over and I have no idea if the issue is even fixed yet arrrghhhh.",
    "image": ""
  },
  {
    "date": "2025-10-12",
    "displayDate": "October 12th, 2025 — 8:18 pm",
    "content": "I spent the entire day setting up this miniblog feature oh my God. I hate GitHub so much. Get me out of Here. Xie Lian Plushie Save Me......",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/xielianplush2.jpg"
  }

]
