[
      {
    "date": "2025-10-18",
    "displayDate": "October 18th, 2025 — 3:55 pm",
    "content": "It took me forever to finish this cross-stitch that I'm not even super in love with, mostly because there's too much contrast between the pinks that I used. Maybe I could try making more in the future with different colors.",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/lotus.jpg"
  },
    {
    "date": "2025-10-18",
    "displayDate": "October 18th, 2025 — 11:38 am",
    "content": "Barnes & Noble is having a Buy 1 Get 1 50% Off sale for their manga/light novel selection until the 19th! I also got my first paycheck last night, so this was the perfect time for me to finally order vol. 7 & 8 of TGCF!",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/b&n.jpg"
  },
{
    "date": "2025-10-16",
    "displayDate": "October 16th, 2025 — 10:00 pm",
    "content": "I've been going through WunderWelt and found a lot of secondhand dresses that I really like. Maybe I could Finally try getting into this lifestyle now that I have a full-time job... But aaagh. Aaaggghh. I don't want to accidentally be an ita... I guess everyone starts somewhere, I'm just worried about spending too much time/money on something that ends up not suiting me. T.T",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/lolita.jpg"
  },
{
    "date": "2025-10-14",
    "displayDate": "October 14th, 2025 — 9:30 pm",
    "content": "I saved $5 on a purchase today because the lady at the register had a few coupons that she wanted to give out. ^.^ Definitely made up for the incredibly boring shift that I had earlier.",
    "image": ""
  },

  {
    "date": "2025-10-14",
    "displayDate": "October 14th, 2025 — 7:36 am",
    "content": "I still haven't recieved my first paycheck because of an error on HR's end...... My payment rolled over and I have no idea if the issue is even fixed yet arrrghhhh.",
    "image": ""
  },
  {
    "date": "2025-10-12",
    "displayDate": "October 12th, 2025 — 8:18 pm",
    "content": "I spent the entire day setting up this miniblog feature oh my God. I hate GitHub so much. Get me out of Here. Xie Lian Plushie Save Me......",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/xielianplush2.jpg"
  }

]
