[ 
{
"date": "2025-12-07",
    "displayDate": "December 7th, 2025 — 5:42 pm",
    "content": "I initially meant to get around to the finishing touches for my big site update today, but then I created a new page before I even realized it... Well... At least I'm already almost done with it, I just keep pushing the goalpost back for myself... I'll update my site sometime this week... Maybe...",
   "image": ""
},
{
"date": "2025-11-25",
    "displayDate": "November 25th, 2025 — 6:46 pm",
    "content": "The power flickered while I was playing Animal Crossing and I'm now getting an earful from Mr. Resetti. It's not my faulllltttt...",
   "image": ""
},
    {
"date": "2025-11-23",
    "displayDate": "November 23rd, 2025 — 4:00 pm",
    "content": "I finally finished my lolita page, and I'm so close to completing my revamped Shirogane shrine... I just need to retype a few paragraphs and maybe add more trivia... I keep moving the goal post back because now I feel the need to type up a whole blogpost to recap my November + there are at least 2 other pages that I really want to create. orz",
   "image": ""
},
    {
"date": "2025-11-23",
    "displayDate": "November 23rd, 2025 — 3:54 pm",
    "content": "I made the foolish mistake last night of including the angle brackets when I mentioned the center tag in my previous entry because it centered the text, but now I wonder... Does this mean that HTML markup work with this miniblog!? I'll have to play around with that later...",
   "image": ""
},
{
"date": "2025-11-22",
    "displayDate": "November 22nd, 2025 — 9:12 pm",
    "content": "Spending so much time optimizing all of my pages only for it to not be noticeable to anyone other than myself. OTL Oh well... I'm at least happy with my coding progress! I replaced all of my center tags, and I've been recreating a bunch of divs featured in my Shirogane shrine for the past hour. I just can't wait to get this huge update out (eventually).",
   "image": ""
},
{
"date": "2025-11-22",
    "displayDate": "November 22nd, 2025 — 9:26 am",
    "content": "I'm tempted to switch my Minecraft survival world to creative (if possible) because I'm tired of grinding for wood/cobblestone/whatever and running back between my unfinished house and a village that I've been trying to restore. I even built a little home with beds to rebuild its population, but then I found out that there's no convenient way to move villagers around. This is too cruel... Update: I switched to creative and I'm so thankful I did... It would have taken me ages to recreate my village vision in survival.",
   "image": ""
},
    {
"date": "2025-11-20",
    "displayDate": "November 20th, 2025 — 9:04 pm",
    "content": "I'm trying to get back into this fuckass drawing that I shelved a couple of months ago but oh my God. It seems like with each passing year, I make more drawings, but I never get past the doodle/sketching phase. But maybe this is better than only making a colored illustration every other month. Hua Cheng you really... will be the death of me......",
   "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/hc.png"
},
{
"date": "2025-11-20",
    "displayDate": "November 20th, 2025 — 10:30 am",
    "content": "I had the strangest dream last night where my dad asked me about Malice Mizer and what was up with “that Mana fellow” because he was on the fence about broadening his music tastes. Edit: Actually. Maybe this isn't that out-of-character for my dad...",
   "image": ""
},
{
"date": "2025-11-19",
    "displayDate": "November 19th, 2025 — 10:35 pm",
    "content": "“every time i feel bad and think “hum maybe i will finally read some more tgcf to cheer myself up” something.insane happens” ← Message I sent to my friends mere moments before Disaster. Now THIS is The TGCF Experience.....",
   "image": ""
},
{
"date": "2025-11-19",
    "displayDate": "November 19th, 2025 — 9:40 am",
    "content": "I'm still not used to having coworkers. Or being around people in general because of my last job. One of my coworkers asked how I'm doing, and I completely blanked before giving her an answer that made her frown. I always wonder how you're supposed to answer that question... The same with “so tell me about yourself”. Do they actually want to know and/or do they want to gauge what you're like? Or is it a small-talk thing? Especially in-passing, do I stop what I'm doing or do I just keep it short? Are they interested in that? Arrgghhgh.",
   "image": ""
},
     {
"date": "2025-11-18",
    "displayDate": "November 18th, 2025 — 9:26 pm",
    "content": "I miss my OCs... Not that I've ever done much with them after all this time. And the only attention that I've given to them on my site is name-dropping Maya a few times and featuring this drawing on a few pages. I'm such a horrible mother...",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/ocs.png"
},
    {
"date": "2025-11-17",
    "displayDate": "November 17th, 2025 — 9:00 pm",
    "content": "This month has been kicking my ass ever since the clocks were set back, and it's been so cold... and dark... and exhausting... I've been in some sort of slump for the past couple of weeks, but I need to Get It Together.",
    "image": ""
},
{
"date": "2025-11-13",
    "displayDate": "November 13th, 2025 — 9:06 am",
    "content": "My phone slipped out of my hands as I was crawling into my car and it somehow faceplanted into the front console hard enough to crack the screen protector. I can at least replace it once I get home... I've never damaged a phone like this before (even if it's just a protector) so this was quite the jumpscare. ^.^;",
    "image": ""
},
       {
"date": "2025-11-08",
    "displayDate": "November 8th, 2025 — 1:40 pm",
    "content": "I wanted to spend the whole day working on my site, but I just found out that my new vehicle registration actually never went through for Reasons and I've been regathering all of the information that I need. I have to put in a money order (my first time ever) sometime this weekend since my 9-5 M-F job prevents me from running errands whenever I want, so the bank and post office isn't viable for me now. Arghh. I'll do it tomorrow. orz",
    "image": ""
},
      {
"date": "2025-11-08",
    "displayDate": "November 8th, 2025 — 8:50 am",
    "content": "Omigosh. I have a hard time watching art-related content, but I loved Emirichu's older journaling videos and always wanted to see more... The latest upload on the Spilled Ink channel has been so fun and insightful...",
    "image": ""
},
                  {
"date": "2025-11-06",
    "displayDate": "November 6th, 2025 — 10:44 pm",
    "content": "I was actually just thinking about it earlier today (and I've had this thought a few times before), it's weird that I rarely ever consider bears as a favorite animal/motif, yet I used to have a teddy bear collection when I was little (I still have one custom plush from the collection), I currently have 5 teddy bears total, I was obsessed with Carebears and also have a few pieces of merch from my childhood, I loved watching The Tangerine Bear every Christmas, I'm wearing panda pajama pants right now... And how could I possibly forget about my rilakkuma closet hanger that has watched over me for many years!",
    "image": ""
},
                    {
"date": "2025-11-06",
    "displayDate": "November 6th, 2025 — 10:32 pm",
    "content": "A video about finding liminal spaces was in my recommendations, but I had a Moment because the thumbnail (not pictured below) had this giant bear (pictured below) in it and I had the same one... I had the 30″ version and he always took up one of the corners of my bed. I don't remember what happened to him...",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/bears.webp"
},
            {
"date": "2025-11-05",
    "displayDate": "November 5th, 2025 — 8:16 pm",
    "content": "Try as I might, I'll never be 100% satisfied with how my bedroom looks. But I think I could at least bring it up to 75% if I ever finish going through all of my belongings and reorganize things.",
    "image": ""
},
                  {
"date": "2025-11-05",
    "displayDate": "November 5th, 2025 — 1:14 pm",
    "content": "Went to a background check center (job requirement) and told the girl scanning my fingerprints “wow I've never had something like this done before” and she was like “... yeah, that's a good thing...” I felt silly because I meant that the whole procedure of rolling my fingers across the screen was interesting or something. I did make another attempt at small talk with her and I think I was able to save face but arghhh I feel so awkward.",
    "image": ""
},
            {
"date": "2025-11-03",
    "displayDate": "November 3rd, 2025 — 7:24 am",
    "content": "Wearing my dress and mary janes around my room before I have to leave for work. Instant mood booster.",
    "image": ""
},
      {
"date": "2025-11-02",
    "displayDate": "November 2nd, 2025 — 9:00 pm",
    "content": "My new page that I've been working on is taking longer than I thought. Or actually I was expecting this. I've been avoiding the writing process (for the most part) by adding more and more images/videos to all of the different sections.",
    "image": ""
},
    {
"date": "2025-11-01",
    "displayDate": "November 1st, 2025 — 9:18 pm",
    "content": "#Haul from earlier today. ^.^ I love the matching colors... After trying on the dress, I'm even more surprised that it was only $20 because the quality is really decent. I wonder if it's because it's technically not a lolita piece, but still. Yay me.",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/haul.jpg"
},
{
"date": "2025-10-31",
    "displayDate": "October 31st, 2025 — 8:04 am",
    "content": "I found this book buried in all of the fabrics that I got last night. I want to start reading through it now but I have to go to work arrgghhh.",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/20251031_080009.jpg"
},
        {
"date": "2025-10-30",
    "displayDate": "October 30th, 2025 — 9:18 pm",
    "content": "I asked my mom if she had a scrap piece of fabric anywhere so that I could practice more stitches, and she ended up giving me a whole box of sewing supplies that I didn't know she still had. I can't Not take this as an opportunity to commit to the craft and learn more... ",
    "image": ""
},
       {
"date": "2025-10-28",
    "displayDate": "October 28th, 2025 — 5:10 pm",
    "content": "Update: I cleaned up all of my code and even started a new page for a future site update, all during my shift. Maybe I should keep bringing my laptop into work...",
    "image": ""
},
      {
"date": "2025-10-28",
    "displayDate": "October 28th, 2025 — 12:48 pm",
    "content": "I took my laptop to work because I hate feeling bored and unproductive during my free time. I'm not sure how often I'll do this because I'm oh-so scared. Or maybe everyone would think “wow she's such a hardworker” since using a laptop probably looks more appealing(?) than scrolling on a phone(?) does this make sense. I guess I can do whatever on my breaks but Agh.",
    "image": ""
},
     {
"date": "2025-10-27",
    "displayDate": "October 27th, 2025 — 10:20 pm",
    "content": "My package came earlier than expected, so now I have cute stationary that I probably won't use any time soon + other things. I also just unintentionally learned how to do an invisible stitch. A very eventful night...",
    "image": ""
},
    {
"date": "2025-10-25",
    "displayDate": "October 25th, 2025 — 12:15 pm",
    "content": "I somehow went from purchasing a $20, secondhand, barely-lolita dress from WunderWelt to ordering 140 dollars' worth of pieces from 42Lolita to create a coord. Don't even ask how much the shipping prices are... I think there's something wrong with me.",
    "image": ""
},
    {
"date": "2025-10-24",
    "displayDate": "October 24th, 2025 — 6:30 am",
    "content": "I'm trying to teach myself how to sew, but I can't even tie a knot for my thread. Let alone make one (1) stitch without messing up. Argh.",
    "image": ""
},
    {
    "date": "2025-10-22",
    "displayDate": "October 22nd, 2025 — 7:50 pm",
    "content": "Update: I bought my first lolita piece! I went with this dress because it's more casual (compared to other lolita pieces) + it was inexpensive, so I thought that this might be a decent starting point. I considered putting a whole coord together, but I also want to make sure that I'll wear the dress often before accesorizing.",
    "image": "https://www.wunderwelt.jp/cdn/shop/files/u-20361-00_1080x.jpg?v=1757406387"
  },
{
    "date": "2025-10-21",
    "displayDate": "October 21st, 2025 — 9:10 am",
    "content": "I somehow forgot to bring my earbuds to work. Fuck my Stupid Baka Life.",
    "image": ""
  },
       {
    "date": "2025-10-19",
    "displayDate": "October 19th, 2025 — 3:00 pm",
    "content": "I spent almost the entirety of my weekend creating my new tips & tricks section, but I'm really happy with how it turned out! I can't wait to add more to it. ^.^",
    "image": ""
  },
      {
    "date": "2025-10-18",
    "displayDate": "October 18th, 2025 — 3:55 pm",
    "content": "It took me forever to finish this cross-stitch that I'm not even super in love with, mostly because there's too much contrast between the pinks that I used. Maybe I could try making more in the future with different colors.",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/lotus.jpg"
  },
    {
    "date": "2025-10-18",
    "displayDate": "October 18th, 2025 — 11:38 am",
    "content": "Barnes & Noble is having a Buy 1 Get 1 50% Off sale for their manga/light novel selection until the 19th! I also got my first paycheck last night, so this was the perfect time for me to finally order vol. 7 & 8 of TGCF!",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/b&n.jpg"
  },
{
    "date": "2025-10-16",
    "displayDate": "October 16th, 2025 — 10:00 pm",
    "content": "I've been going through WunderWelt and found a lot of secondhand dresses that I really like. Maybe I could Finally try getting into this lifestyle now that I have a full-time job... But aaagh. Aaaggghh. I don't want to accidentally be an ita... I guess everyone starts somewhere, I'm just worried about spending too much time/money on something that ends up not suiting me. T.T",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/lolita.jpg"
  },
{
    "date": "2025-10-14",
    "displayDate": "October 14th, 2025 — 9:30 pm",
    "content": "I saved $5 on a purchase today because the lady at the register had a few coupons that she wanted to give out. ^.^ Definitely made up for the incredibly boring shift that I had earlier.",
    "image": ""
  },

  {
    "date": "2025-10-14",
    "displayDate": "October 14th, 2025 — 7:36 am",
    "content": "I still haven't recieved my first paycheck because of an error on HR's end...... My payment rolled over and I have no idea if the issue is even fixed yet arrrghhhh.",
    "image": ""
  },
  {
    "date": "2025-10-12",
    "displayDate": "October 12th, 2025 — 8:18 pm",
    "content": "I spent the entire day setting up this miniblog feature oh my God. I hate GitHub so much. Get me out of Here. Xie Lian Plushie Save Me......",
    "image": "https://raw.githubusercontent.com/sunfish00/miniblog/main/img/xielianplush2.jpg"
  }

]
